# Hypothesis Testing Exercises

 ## Overview Exercises
 ***For each of the following questions, formulate a null and alternative hypothesis (be as specific as you can be), then give an example of what a true positive, true negative, type I and type II errors would look like. Note that some of the questions are intentionally phrased in a vague way. It is your job to reword these as more precise questions that could be tested.***

- **1. Has the network latency gone up since we switched internet service providers?**

- H<sub>o</sub> : There is no difference on network latency since switching ISPs
- H<sub>*a*</sub> : Switching ISPs has increased network latency


- True Positive: Switching ISPs **has** affected latency and we **rejected** H<sub>o</sub> in testing
- True Negative: Switching ISPs **has not** affected latency and we **accepted** H<sub>o</sub> in testing
- Type I Error:  Switching ISPs **has not** affected latency but we **rejected** H<sub>o</sub> in testing
- Type II Error: Switching ISPs **has** affecetd latency but we **accepted** H<sub>o</sub> in testing

- **2. Is the website redesign any good?**

- H<sub>o</sub> : The website redesign has had no impact on the average time users spend on the website
- H<sub>*a*</sub> : The website redesign has increased the average time users spend on the website


- True Positive: Redesign **has** increased avg user time and we **rejected** H<sub>o</sub> in testing
- True Negative: Redesign **has not** increased avg user time and we **accepted** H<sub>o</sub> in testing
- Type I Error:  Redesign **has not** increased avg user time but we **rejected** H<sub>o</sub> in testing
- Type II Error: Redesign **has** increased avg user time but we **accepted** H<sub>o</sub> in testing

- **3. Is our television ad driving more sales?**

- H<sub>o</sub> : Sales have not increased after airing our TV ad
- H<sub>*a*</sub> : Sales have increased since airing our TV ad 


- True Positive: Sales **have** increased and we **rejected** H<sub>o</sub> in testing
- True Negative: Sales  **have not** increased and we **accepted** H<sub>o</sub> in testing
- Type I Error:  Sales **have not** increased but we **rejected** H<sub>o</sub> in testing
- Type II Error: Sales **have** increased but we **accepted** H<sub>o</sub> in testing

## T-test Exercises

In [1]:
from math import sqrt
from scipy import stats
from scipy.stats import ttest_ind_from_stats

%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns
from pydataset import data

### Ace Realty wants to determine whether the average time it takes to sell homes is different for its two offices. A sample of 40 sales from office #1 revealed a mean of 90 days and a standard deviation of 15 days. A sample of 50 sales from office #2 revealed a mean of 100 days and a standard deviation of 20 days. Use a .05 level of significance.

In [ ]:
#List the data we have 

#Avg time it takes each office to sell homes
office_1_mean = 90
office_2_mean = 100

#Stdev for the avg time it takes to sell homes 
office_1_sd = 15
office_2_sd = 20

In [ ]:
#Setup the test and set the confidence level
null_hypothesis = "There is no difference in average time for selling homes between the two Ace Realty offices"
alt_hypothesis = "There is a difference in avg time for selling homes"
confidence_level = .95
a = 1 - confidence_level

In [ ]:
#Use scipy to conduct the t-test
t, p = stats.ttest_ind_from_stats(office_1_mean, office_1_sd, 40, office_2_mean, office_2_sd, 50)
t, p

In [ ]:
if p > a:
    print(f"{null_hypothesis}")
else:
    print(f"Reject the null hypothesis. {alt_hypothesis}.")

### Load the mpg dataset and use it to answer the following questions:

In [2]:
from pydataset import data
mpg = data("mpg")
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

- **Is there a difference in fuel-efficiency in cars from 2008 vs 1999?**

In [ ]:
#Prepare the data:

#Step 1: Calculate the avg mpg
mpg['avg_mpg'] = (mpg.cty + mpg.hwy) / 2
mpg.head()

#Note from demo: In the future, when dealing with rates(ratios) like mpg, I may want to use harmonic mean instead of arithmatic mean

In [ ]:
#Step 2: Classify vehicles by the years 2008 and 1999
cars_from_99 = mpg[mpg.year == 1999]
cars_from_08 = mpg[mpg.year == 2008]

In [ ]:
#Setup the test and set the confidence level
null_hypothesis = "There is no difference in fuel-efficiency in cars from 2008 vs 1999"
alt_hypothesis = "There is a difference in fuel-efficiency in cars from 2008 vs 1999"

confidence_level = .95
a = 1 - confidence_level

In [ ]:
#Use ttest_ind for a two sample t-test
t, p = stats.ttest_ind(cars_from_99.avg_mpg,cars_from_08.avg_mpg)
t, p

In [ ]:
#Use a two-tailed test
if p < a: 
    print("Reject the null hypothesis that there is no difference in fuel-efficiency")
    print("Move forward with the understanding that there is a difference in efficiency between cars from 1999 and 2008")
else:
    print("Fail to reject the null hypothesis.")
    print("Not enough evidence to support a difference in fuel-efficiency.")

- **Are compact cars more fuel-efficient than the average car?**

In [ ]:
#Rename the class column because class is a reserved word in python
mpg = mpg.rename(columns={'class': 'class_of_car'})

In [ ]:
#Separate the compact car data sets to compare against the population
compact_cars = mpg[mpg.class_of_car == "compact"]

In [ ]:
#Setup the test and set the confidence level
null_hypothesis = "There is no difference in fuel-efficiency for compact vs average cars"
alt_hypothesis = "Compact cars are more efficient than the average car"
confidence_level = .95
a = 1 - confidence_level

In [ ]:
#use ttest_ind for a one-sample t-test
t, p = stats.ttest_1samp(compact_cars.avg_mpg, mpg.avg_mpg.mean())
t,p

In [ ]:
#Set a one-tailed test 
if p/2 < a and t > 0:
    print("Reject the null hypothesis that states there is no difference in fuel-efficiency")
    print("Move forward with the understanding that compact cars are more efficient than the average car.")
else:
    print(f'Fail to reject the null hypothesis. There is not enough eveidence to support the claim: {alt_hypothesis}')

- **Do manual cars get better gas mileage than automatic cars?**

In [ ]:
#Prepare the data by grouping manual and automatic cars
def trans_type(x):
    if "auto" in x:
        return "auto"
    else:
        return "manual"

In [ ]:
#Assign the cars one of two variables where auto == automatic transmission and manual == manual transmission
mpg['trans_type'] = mpg.trans.apply(trans_type)

In [ ]:
#Separate the two data sets for comparison
auto_cars = mpg[mpg.trans_type == 'auto']
manual_cars = mpg[mpg.trans_type == 'manual']

In [ ]:
#Setup the test and select a confidence level 
null_hypothesis = "There is no difference in gas mileage for automatic vs manual cars"
alt_hypothesis = "Manual cars get better gas mileage than automatic cars"
confidence_level = .95
a = 1 - confidence_level

In [ ]:
#Use ttest_ind for the two sample t-test
t, p = stats.ttest_ind(manual_cars.avg_mpg, auto_cars.avg_mpg)
t, p

In [ ]:
#Since we are testing against whether or not manual cars get better gas mileage, I will use a one-tailed test:
if p/2 < a and  t > 0:
    print("Reject the null hypothesis that states there is no difference in gas mileage for automatic vs. manual cars")
    print("Move forward with the understanding that manual cars get better gas mileage than automatic cars.")
else:
    print("Fail to reject the null hypothesis.")
    print(f"There is not enough evidence to support the claim: {alt_hypothesis}")

## Correlation Exercises

**1. Use the telco_churn data.**

In [ ]:
df = pd.read_csv('Cust_Churn_Telco.csv')
df.info()

- **a.  Does tenure correlate with monthly charges?**

In [ ]:
#Set the confidence interval for the correlation test
null_hypothesis = 'There is no correlation between tenure and monthly charges'
alt_hypothesis = 'There is a correlation between tenure and monthly charges'
confidence_int = .95
a = 1 - confidence_int

In [ ]:
#visualize the data
sns.scatterplot(x='tenure', y='MonthlyCharges', data=df)

In [ ]:
#Setup the correlation test
corr, p = stats.pearsonr(df.tenure, df.MonthlyCharges)
corr, p

In [ ]:
if p < a:
    print("Reject the null hypothesis")
    print("Move forward with the understanding there is a correlation between monthly charges and tenure")
else:
    print("Fail to reject the null hypothesis.")
    print("N")

 - **b. Total charges?**

In [ ]:
#Clean the data to remove nulls
telco_churn = df[df.TotalCharges > 0]
telco_churn.sort_values(by="TotalCharges")

In [ ]:
#Set the confidence interval for the correlation test
null_hypothesis = 'There is no correlation between tenure and total charges'
alt_hypothesis = 'There is a correlation between tenure and total charges'
confidence_int = .95
a = 1 - confidence_int

In [ ]:
#visualize the data
sns.scatterplot(x='tenure', y='TotalCharges', data=telco_churn)

In [ ]:
corr, p = stats.pearsonr(telco_churn.tenure, telco_churn.TotalCharges)
corr, p

In [ ]:
if p < a:
    print("Reject the null hypothesis")
    print("Move forward with the understanding there is a correlation between total charges and tenure")
else:
    print("Fail to reject the null hypothesis.")
    print("N")

 - **c. What happens if you control for phone and internet service?**

In [ ]:
#Setup correlation test and control for phone service only
null_hypothesis = "There is no correlation between tenure and monthly charges for customers with phone service only "
alt_hypothesis = "There is a correlation between tenure and monthly charges for phone service customers"
confidence_int = .95
a = 1 - confidence_int

In [ ]:
r_tenure_phone_only = corr, p = stats.pearsonr(telco_churn.tenure[(telco_churn.PhoneService == "Yes") & (telco_churn.InternetService == "No")], telco_churn.MonthlyCharges[(telco_churn.PhoneService == "Yes") & (telco_churn.InternetService == "No")])
r_tenure_phone_only

In [ ]:
if p < a:
    print("Reject the null hypothesis")
    print("Move forward with the understanding there is a correlation between monthly charges and tenure for phone service customers")
else:
    print("Fail to reject the null hypothesis.")
    print("N")

In [ ]:
#Setup correlation test and control for internet service only
null_hypothesis = "There is no correlation between tenure and monthly charges for customers with internet service only "
alt_hypothesis = "There is a correlation between tenure and monthly charges for internet service customers"
confidence_int = .95
a = 1 - confidence_int

In [ ]:
r_tenure_internet_only = corr, p = stats.pearsonr(telco_churn.tenure[(telco_churn.PhoneService == "No") & (telco_churn.InternetService != "No")], telco_churn.MonthlyCharges[(telco_churn.PhoneService == "No") & (telco_churn.InternetService != "No")])
r_tenure_internet_only

In [ ]:
if p < a:
    print("Reject the null hypothesis")
    print("Move forward with the understanding there is a correlation between monthly charges and tenure for phone service customers")
else:
    print("Fail to reject the null hypothesis.")
    print("N")

### The solution below was shared as a more advanced solution during the exercise demo. I am including the code here to refer back to in the future as an example of a way to use nested dictionaries and loops to control for multiple variables in a more programmtic way:

In [ ]:
telco_churn['InternetService'] = 'Internet Service: ' + telco_churn['InternetService']
telco_churn['PhoneService'] = 'Phone Service: ' + telco_churn['PhoneService']
telco_churn['Internet_and_Phone'] = telco_churn['InternetService'] + telco_churn['PhoneService']

In [ ]:
telco_churn['Internet_and_Phone'].value_counts()

In [ ]:
x = {}
y = {}
control = ['InternetService', 'PhoneService', 'Internet_and_Phone']
for cntrl in control:
    for val in telco_churn[cntrl].unique():
        x[val] = {}
        y[val] = {}
        x[val]['tenure'] = telco_churn['tenure'][telco_churn[cntrl]== val]
        y[val]['TotalCharges'] = telco_churn['TotalCharges'][telco_churn[cntrl]== val]
        y[val]['MonthlyCharges'] = telco_churn['MonthlyCharges'][telco_churn[cntrl]== val]

In [ ]:
x['Internet Service: DSL'].keys()

In [ ]:
for key in y:
    print('For customers with {key}: ')
    for subkey in y[key]:
        print(f'For an x of tenure and a y of {subkey}: ')
        r, p = stats.pearsonr(x[key]['tenure'], y[key][subkey])
        print(f'Pearson Correlation is calculated at {r} with a p value of {p}')
        if p < 0.05:
            print(f' p is less than our alpha and we can reject the null hypothesis')
        plt.title(f'For an x of tenure and a y of {subkey} under the control of {key}, r={r:.3f}')
        plt.scatter(x[key]['tenure'], y[key][subkey])
        plt.show()
        plt.clf()
        print('------------------------------------')
        print('------------------------------------')
        print('------------------------------------')

### Use the employees database.

In [3]:
from env import host, user, password

def get_db_url(db, user=user, host=host, password=password):
    return f'mysql+pymysql://{user}:{password}@{host}/employees'

- **Is there a relationship between how long an employee has been with the company and their salary?**

Need to prepare data by: 
- Group data by emp_no so each employee only appears once
    - This is a good example of where I would need to get clarification in the planning stage of the DS pipeline by asking the following questions:
        - Do we want analysis to be inclusive of an employees past titles and salaries? 
        - How does including an employees previous titles (and presumably lower salaries) affect the data analysis? 
        - On the flipside: if we do not account for this individual change of salary and title over time, how does that affect the analysis? 
        - Is an employee who has had the same title for 10 years comparable to an employee who has seen x number of raises and title changes over the same 10 yeat period?
        
- Calculate employee tenure
    - Need to deal with to_dates for current employees

In [4]:
sql = """
select *, datediff(CURDATE(), hire_date) as 'tenure'
from employees as emp
JOIN salaries using (emp_no)
JOIN titles using (emp_no) 
WHERE salaries.to_date >= CURDATE()
"""

employees = pd.read_sql(sql, get_db_url('employees'))
employees.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,salary,from_date,to_date,title,from_date,to_date,tenure
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,88958,2002-06-22,9999-01-01,Senior Engineer,1986-06-26,9999-01-01,12654
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,72527,2001-08-02,9999-01-01,Staff,1996-08-03,9999-01-01,12871
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,43311,2001-12-01,9999-01-01,Senior Engineer,1995-12-03,9999-01-01,12591
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,74057,2001-11-27,9999-01-01,Engineer,1986-12-01,1995-12-01,12496
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,74057,2001-11-27,9999-01-01,Senior Engineer,1995-12-01,9999-01-01,12496

In [ ]:
employees.info()

In [5]:
#Prepare data: drop salary.to_date column
employees = employees.drop(columns={employees.columns[8]})
employees.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,salary,from_date,title,from_date,tenure
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,88958,2002-06-22,Senior Engineer,1986-06-26,12654
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,72527,2001-08-02,Staff,1996-08-03,12871
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,43311,2001-12-01,Senior Engineer,1995-12-03,12591
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,74057,2001-11-27,Engineer,1986-12-01,12496
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,74057,2001-11-27,Senior Engineer,1995-12-01,12496

In [29]:
#Set up correlation test:
null_hypothesis = "There is no correlation between tenure and salary"
alt_hypothesis = "Salary and tenure are correlated"
confidence_int = .95
a = 1 - confidence_int

In [30]:
corr, p = stats.pearsonr(employees.tenure, employees.salary)
corr, p

(0.3072819093214674, 0.0)

In [31]:
if p < a:
    print("Reject the null hypothesis")
    print(f"Move forward with the understanding there is a correlation ({corr.round(3)}) between salary and tenure")
else:
    print("Fail to reject the null hypothesis.")

Reject the null hypothesis
Move forward with the understanding there is a correlation (0.307) between salary and tenure

- **Is there a relationship between how long an employee has been with the company and the number of titles they have had?**

In [15]:
employees.head()

,emp_no,first_name,last_name,gender,hire_date,salary,title,tenure
0,10001,Georgi,Facello,M,1986-06-26,88958,Senior Engineer,12654
1,10002,Bezalel,Simmel,F,1985-11-21,72527,Staff,12871
2,10003,Parto,Bamford,M,1986-08-28,43311,Senior Engineer,12591
3,10004,Chirstian,Koblick,M,1986-12-01,74057,Engineer,12496
4,10004,Chirstian,Koblick,M,1986-12-01,74057,Senior Engineer,12496

In [10]:
employees = employees.drop(columns={'birth_date', 'from_date'})

In [12]:
countref = employees.groupby('emp_no').count()[['title']].rename(columns={'title': 'titlecount'})

In [16]:
employees.head()

,emp_no,first_name,last_name,gender,hire_date,salary,title,tenure
0,10001,Georgi,Facello,M,1986-06-26,88958,Senior Engineer,12654
1,10002,Bezalel,Simmel,F,1985-11-21,72527,Staff,12871
2,10003,Parto,Bamford,M,1986-08-28,43311,Senior Engineer,12591
3,10004,Chirstian,Koblick,M,1986-12-01,74057,Engineer,12496
4,10004,Chirstian,Koblick,M,1986-12-01,74057,Senior Engineer,12496

In [17]:
merged = pd.merge(employees, countref, how='left', on='emp_no')

In [20]:
merged.head()

,emp_no,first_name,last_name,gender,hire_date,salary,title,tenure,titlecount
0,10001,Georgi,Facello,M,1986-06-26,88958,Senior Engineer,12654,1
1,10002,Bezalel,Simmel,F,1985-11-21,72527,Staff,12871,1
2,10003,Parto,Bamford,M,1986-08-28,43311,Senior Engineer,12591,1
3,10004,Chirstian,Koblick,M,1986-12-01,74057,Engineer,12496,2
4,10004,Chirstian,Koblick,M,1986-12-01,74057,Senior Engineer,12496,2

null_hypothesis = "There is no correlation between the number of titles has had and their tenure."
alt_hypothesis = "There is a correclation between the number of titles held and tenure."
confidence_int = .95
a = 1 - confidence_int

In [21]:
corr, p = stats.pearsonr(merged.tenure, merged.titlecount)
corr, p

(0.2874004366228014, 0.0)

In [27]:
if p < a:
    print("Reject the null hypothesis")
    print(f"Move forward with the understanding there is a correlation ({corr.round(3)}) between the number of titles an employee has held and the employee's tenure.")
else:
    print("Fail to reject the null hypothesis.")

Reject the null hypothesis
Move forward with the understanding there is a correlation (0.287) between the number of titles an employee has held and the employee's tenure.

### Use the sleepstudy data. Is there a relationship between days and reaction time?

In [3]:
sleepstudy = data('sleepstudy')
sleepstudy.head()

   Reaction  Days  Subject
1  249.5600     0      308
2  258.7047     1      308
3  250.8006     2      308
4  321.4398     3      308
5  356.8519     4      308

In [4]:
null_hypothesis = "There is no correlation between days of sleep deprevation and reaction time."
alt_hypothesis = "There is a correclation between days of sleep deprevation and reaction time"
confidence_int = .95
a = 1 - confidence_int

In [6]:
corr, p = stats.pearsonr(sleepstudy.Reaction, sleepstudy.Days)
corr, p

(0.5352302262650253, 9.894096322214812e-15)

In [7]:
if p < a:
    print("Reject the null hypothesis")
    print("Move forward with the understanding there is a correlation between days of sleep deprevation and reaction time")
else:
    print("Fail to reject the null hypothesis.")

Reject the null hypothesis
Move forward with the understanding there is a correlation between days of sleep deprevation and reaction time

## Chi Square Exercises

### 1. Use the following contingency table to help answer the question of whether using a macbook and being a codeup student are independent of each other.

In [2]:
contingency = pd.DataFrame({'codeup_student': [49,1], 'not_codeup': [20,30]}, index=['uses_macbook', 'no_macbook'])
contingency

              codeup_student  not_codeup
uses_macbook              49          20
no_macbook                 1          30

In [3]:
null_hypothesis = "Being a codeup student is not dependent upon using a mac"
alt_hypothesis = "Being a codeup student is dependent upon using a mac"
confidence_interval = .95
a = 1 - confidence_interval

In [4]:
chi2, p, degf, expected = stats.chi2_contingency(contingency)
chi2, p, degf, expected

(36.65264142122487,
 1.4116760526193828e-09,
 1,
 array([[34.5, 34.5],
        [15.5, 15.5]]))

In [5]:
if p < a:
    print("We reject the null")
else:
    print("We fail to reject the null")

We reject the null

### 2. Choose another 2 categorical variables from the mpg dataset and perform a Chi Square contingency table test with them. Be sure to state your null and alternative hypotheses.

In [10]:
null_hypothesis = "City fuel-efficiency is not dependent upon the number of cylinders"
alt_hypothesis = "City fuel-efficiency is dependent upon the number of cylinders"
confidence_level = .95
a = 1 - confidence_level

In [11]:
observed = pd.crosstab(mpg.cyl, mpg.cty)
observed

cty,9,11,12,13,14,15,16,17,18,19,...,21,22,23,24,25,26,28,29,33,35
cyl,,,,,,,,,,,,,,,,,,,,,
4,0,0,0,0,0,2,3,1,9,14,...,21,4,3,5,2,3,2,1,1,1
5,0,0,0,0,0,0,0,0,0,0,...,2,0,0,0,0,0,0,0,0,0
6,0,1,0,4,9,15,12,15,17,6,...,0,0,0,0,0,0,0,0,0,0
8,5,19,8,17,10,7,4,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [12]:
chi2, p, degf, expected = stats.chi2_contingency(observed)

In [13]:
chi2, p, degf, expected

(299.2012777737343,
 1.772291602573763e-33,
 60,
 array([[1.73076923, 6.92307692, 2.76923077, 7.26923077, 6.57692308,
         8.30769231, 6.57692308, 5.53846154, 9.        , 6.92307692,
         3.80769231, 7.96153846, 1.38461538, 1.03846154, 1.73076923,
         0.69230769, 1.03846154, 0.69230769, 0.34615385, 0.34615385,
         0.34615385],
        [0.08547009, 0.34188034, 0.13675214, 0.35897436, 0.32478632,
         0.41025641, 0.32478632, 0.27350427, 0.44444444, 0.34188034,
         0.18803419, 0.39316239, 0.06837607, 0.05128205, 0.08547009,
         0.03418803, 0.05128205, 0.03418803, 0.01709402, 0.01709402,
         0.01709402],
        [1.68803419, 6.75213675, 2.7008547 , 7.08974359, 6.41452991,
         8.1025641 , 6.41452991, 5.4017094 , 8.77777778, 6.75213675,
         3.71367521, 7.76495726, 1.35042735, 1.01282051, 1.68803419,
         0.67521368, 1.01282051, 0.67521368, 0.33760684, 0.33760684,
         0.33760684],
        [1.4957265 , 5.98290598, 2.39316239, 6.28205128, 5.68376068,
         7.17948718, 5.68376068, 4.78632479, 7.77777778, 5.98290598,
         3.29059829, 6.88034188, 1.1965812 , 0.8974359 , 1.4957265 ,
         0.5982906 , 0.8974359 , 0.5982906 , 0.2991453 , 0.2991453 ,
         0.2991453 ]]))

In [14]:
if p < a:
    print("We reject the null")
else:
    print("We fail to reject the null")

We reject the null

### 3. Use the data from the employees database to answer these questions:

In [ ]:
sql = """
select *
from employees
JOIN dept_emp using (emp_no)
JOIN departments using (dept_no)
WHERE to_date > CURDATE()
"""

employees = pd.read_sql(sql, get_db_url('employees'))
employees.head()

- **Is an employee's gender independent of whether an employee works in sales or marketing? (only look at current employees)**

In [ ]:
employees["sales_and_marketing"] = employees['dept_name'] == ("Sales" or "Marketing")

In [ ]:
null_hypothesis = "Working in Sales or Marketing is not dependent on gender"
alt_hypothesis = "Working in Sales or Marketing is dependent on gender"
confidence_level = .95
a = 1 - confidence_level

In [ ]:
observed = pd.crosstab(employees.gender, employees.sales_and_marketing)
observed

In [ ]:
chi2, p, degf, expected = stats.chi2_contingency(observed)

if p < a:
    print("We reject the null hypothesis")
else:
    print("We fail to reject the null")
p

- **Is an employee's gender independent of whether or not they are or have been a manager?**

In [23]:
#Set the Chi test and alpha
null_hypothesis = "Being a manager is not dependent on gender."
alt_hypothesis = "Being a manager is dependent on gender"
confidence_int = .99
a = 1 - confidence_int

In [17]:
sql = """
select employees.emp_no, employees.gender, dept_manager.dept_no
from employees
LEFT JOIN dept_manager ON employees.emp_no = dept_manager.emp_no

"""

managers = pd.read_sql(sql, get_db_url('employees'))
managers

        emp_no gender dept_no
0        10001      M    None
1        10002      F    None
2        10003      M    None
3        10004      M    None
4        10005      M    None
...        ...    ...     ...
300019  499995      F    None
300020  499996      M    None
300021  499997      M    None
300022  499998      M    None
300023  499999      M    None

[300024 rows x 3 columns]

In [18]:
#Change dept_no to managers to determine if the corresponding employee is a manager. Fill nulls. 
managers = managers.rename(columns={'dept_no': 'manager'}).fillna(0)

In [19]:
#Set the manager column to int values where 0 = not a manager and 1 = is a manager
managers['manager'] = managers['manager'].apply(lambda x: x if x == 0 else 1)

In [20]:
#Setup crosstab
observed = pd.crosstab(managers['gender'], managers['manager'] )
observed

manager       0   1
gender
F        120038  13
M        179962  11

In [24]:
#Run Chi test
chi2, p, degf, expected = stats.chi2_contingency(observed)

In [25]:
#Evaluate against the null hypothesis
if p < a:
    print("Reject the null hypothesis")
else:
    print("Fail to reject the null hypothesis")

Fail to reject the null hypothesis